import * as React from 'react';
import * as Styled from './styles';

const TextBackground: React.SFC = () => {
  return (
    <Styled.TextWrapper>
      <p>
        글 매무새는 일종의 자간과 행간, 글 너비를 조절해 더 보기 좋은 웹
        타이포그래피를 만드는 연습을 할 수 있는 웹 게임입니다. UI/UX 디자이너로
        IT 업계에 처음 발을 들이고, 현재는 웹 프론트엔드 엔지니어로 일하고 있는
        <span>‘길범준’</span>의 사이드 프로젝트로 제작되었으며, 글 매무새가 많은
        사람들께 공개될 수 있도록 모범 답안 제작을 도와주신 <span>설다혜 </span>디자이너님,
        김단아 디자이너님, <span>이세인</span> 디자이너님, 구창림 디자이너님, 최서윤
        디자이너님께 감사 인사 드립니다. 또한 사이드 프로젝트 기획 후, 눈길도
        보지 않았던 프로젝트를 완성까지 이끌어준{' '}
        <span>‘Do what you want to do’</span> 행사 관계자 분들께 감사 인사
        드립니다. ‘글 매무새’ 라는 이름은 ‘어떤 생각을 일정한 형식에 따라 글자로
        나타낸 것’ 을 뜻하는 ‘글’과 ‘옷, 머리 따위를 수습하여 입거나 손질한
        모양새’를 뜻하며 주로 ‘옷매무새’ 라는 단어로 같이 사용되는 ‘매무새’의
        합성어입니다. 영어 웹 타이포그래피 연습 게임인 ‘The Equilateral Triangle
        of a Perfect Paragraph’의 한국어 버젼이며, 원작자인 <span>Matej Latin</span>에게
        허락을 받은 뒤 제작되었습니다. 글 매무새는 일종의 자간과 행간, 글 너비를
        조절해 더 보기 좋은 웹 타이포그래피를 만드는 연습을 할 수 있는 웹
        게임입니다. UI/UX 디자이너로 IT 업계에 처음 발을 들이고, 현재는 웹
        프론트엔드 엔지니어로 일하고 있는 <span>‘길범준’</span>의 사이드
        프로젝트로 제작되었으며, 글 매무새가 많은 사람들께 공개될 수 있도록 모범
        답안 제작을 도와주신 <span>설다혜 </span>디자이너님, 김단아 디자이너님, <span>이세인</span>
        디자이너님, 구창림 디자이너님, 최서윤 디자이너님께 감사 인사 드립니다.
        또한 사이드 프로젝트 기획 후, 눈길도 보지 않았던 프로젝트를 완성까지
        이끌어준 ‘Do what you want to do’ 행사 관계자 분들께 감사 인사 드립니다.
        ‘글 매무새’ 라는 이름은 ‘어떤 생각을 일정한 형식에 따라 글자로 나타낸
        것’ 을 뜻하는 ‘글’과 ‘옷, 머리 따위를 수습하여 입거나 손질한 모양새’를
        뜻하며 주로 ‘옷매무새’ 라는 단어로 같이 사용되는 ‘매무새’의
        합성어입니다. 영어 웹 타이포그래피 연습 게임인 ‘The Equilateral Triangle
        of a Perfect Paragraph’의 한국어 버젼이며, 원작자인 <span>Matej Latin</span>에게
        허락을 받은 뒤 제작되었습니다. 글 매무새는 일종의 자간과 행간, 글 너비를
        조절해 더 보기 좋은 웹 타이포그래피를 만드는 연습을 할 수 있는 웹
        게임입니다. UI/UX 디자이너로 IT 업계에 처음 발을 들이고, 현재는 웹
        프론트엔드 엔지니어로 일하고 있는 <span>‘길범준’</span>의 사이드
        프로젝트로 제작되었으며, 글 매무새가 많은 사람들께 공개될 수 있도록 모범
        답안 제작을 도와주신 <span>설다혜 </span>디자이너님, 김단아 디자이너님, <span>이세인</span>
        디자이너님, 구창림 디자이너님, 최서윤 디자이너님께 감사 인사 드립니다.
        또한 사이드 프로젝트 기획 후, 눈길도 보지 않았던 프로젝트를 완성까지
        이끌어준 <span>‘Do what you want to do’</span> 행사 관계자 분들께 감사
        인사 드립니다. ‘글 매무새’ 라는 이름은 ‘어떤 생각을 일정한 형식에 따라
        글자로 나타낸 것’ 을 뜻하는 ‘글’과 ‘옷, 머리 따위를 수습하여 입거나
        손질한 모양새’를 뜻하며 주로 ‘옷매무새’ 라는 단어로 같이 사용되는
        ‘매무새’의 합성어입니다. 영어 웹 타이포그래피 연습 게임인 ‘The
        Equilateral Triangle of a Perfect Paragraph’의 한국어 버젼이며, 원작자인
        <span>Matej Latin</span>에게 허락을 받은 뒤 제작되었습니다. 글 매무새는 일종의 자간과
        행간, 글 너비를 조절해 더 보기 좋은 웹 타이포그래피를 만드는 연습을 할
        수 있는 웹 게임입니다. UI/UX 디자이너로 IT 업계에 처음 발을 들이고,
        현재는 웹 프론트엔드 엔지니어로 일하고 있는 <span>‘길범준’</span>의
        사이드 프로젝트로 제작되었으며, 글 매무새가 많은 사람들께 공개될 수
        있도록 모범 답안 제작을 도와주신 <span>설다혜 </span>디자이너님, 김단아 디자이너님,
        <span>이세인</span> 디자이너님, 구창림 디자이너님, 최서윤 디자이너님께 감사 인사
        드립니다. 또한 사이드 프로젝트 기획 후, 눈길도 보지 않았던 프로젝트를
        완성까지 이끌어준 ‘Do what you want to do’ 행사 관계자 분들께 감사 인사
        드립니다. ‘글 매무새’ 라는 이름은 ‘어떤 생각을 일정한 형식에 따라 글자로
        나타낸 것’ 을 뜻하는 ‘글’과 ‘옷, 머리 따위를 수습하여 입거나 손질한
        모양새’를 뜻하며 주로 ‘옷매무새’ 라는 단어로 같이 사용되는 ‘매무새’의
        합성어입니다. 영어 웹 타이포그래피 연습 게임인 ‘The Equilateral Triangle
        of a Perfect Paragraph’의 한국어 버젼이며, 원작자인 <span>Matej Latin</span>에게
        허락을 받은 뒤 제작되었습니다. 글 매무새는 일종의 자간과 행간, 글 너비를
        조절해 더 보기 좋은 웹 타이포그래피를 만드는 연습을 할 수 있는 웹
        게임입니다. UI/UX 디자이너로 IT 업계에 처음 발을 들이고, 현재는 웹
        프론트엔드 엔지니어로 일하고 있는 <span>‘길범준’</span>의 사이드
        프로젝트로 제작되었으며, 글 매무새가 많은 사람들께 공개될 수 있도록 모범
        답안 제작을 도와주신 <span>설다혜 </span>디자이너님, 김단아 디자이너님, <span>이세인</span>
        디자이너님, 구창림 디자이너님, 최서윤 디자이너님께 감사 인사 드립니다.
        또한 사이드 프로젝트 기획 후, 눈길도 보지 않았던 프로젝트를 완성까지
        이끌어준 <span>‘Do what you want to do’</span> 행사 관계자 분들께 감사
        인사 드립니다. ‘글 매무새’ 라는 이름은 ‘어떤 생각을 일정한 형식에 따라
        글자로 나타낸 것’ 을 뜻하는 ‘글’과 ‘옷, 머리 따위를 수습하여 입거나
        손질한 모양새’를 뜻하며 주로 ‘옷매무새’ 라는 단어로 같이 사용되는
        ‘매무새’의 합성어입니다. 영어 웹 타이포그래피 연습 게임인 ‘The
        Equilateral Triangle of a Perfect Paragraph’의 한국어 버젼이며, 원작자인
        <span>Matej Latin</span>에게 허락을 받은 뒤 제작되었습니다. 글 매무새는 일종의 자간과
        행간, 글 너비를 조절해 더 보기 좋은 웹 타이포그래피를 만드는 연습을 할
        수 있는 웹 게임입니다. UI/UX 디자이너로 IT 업계에 처음 발을 들이고,
        현재는 웹 프론트엔드 엔지니어로 일하고 있는 <span>‘길범준’</span>의
        사이드 프로젝트로 제작되었으며, 글 매무새가 많은 사람들께 공개될 수
        있도록 모범 답안 제작을 도와주신 <span>설다혜 </span>디자이너님, 김단아 디자이너님,
        <span>이세인</span> 디자이너님, 구창림 디자이너님, 최서윤 디자이너님께 감사 인사
        드립니다. 또한 사이드 프로젝트 기획 후, 눈길도 보지 않았던 프로젝트를
        완성까지 이끌어준 ‘Do what you want to do’ 행사 관계자 분들께 감사 인사
        드립니다. ‘글 매무새’ 라는 이름은 ‘어떤 생각을 일정한 형식에 따라 글자로
        나타낸 것’ 을 뜻하는 ‘글’과 ‘옷, 머리 따위를 수습하여 입거나 손질한
        모양새’를 뜻하며 주로 ‘옷매무새’ 라는 단어로 같이 사용되는 ‘매무새’의
        합성어입니다. 영어 웹 타이포그래피 연습 게임인 ‘The Equilateral Triangle
        of a Perfect Paragraph’의 한국어 버젼이며, 원작자인 <span>Matej Latin</span>에게
        허락을 받은 뒤 제작되었습니다.
      </p>
    </Styled.TextWrapper>
  );
};

export default TextBackground;
